Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
prune_low_magnitude_conv2d_5 (None, 148, 110, 96)      69794     
_________________________________________________________________
prune_low_magnitude_activati (None, 148, 110, 96)      1         
_________________________________________________________________
prune_low_magnitude_max_pool (None, 74, 55, 96)        1         
_________________________________________________________________
prune_low_magnitude_conv2d_6 (None, 64, 45, 256)       5947650   
_________________________________________________________________
prune_low_magnitude_activati (None, 64, 45, 256)       1         
_________________________________________________________________
prune_low_magnitude_max_pool (None, 32, 22, 256)       1         
_________________________________________________________________
prune_low_magnitude_conv2d_7 (None, 30, 20, 384)       1769858   
_________________________________________________________________
prune_low_magnitude_activati (None, 30, 20, 384)       1         
_________________________________________________________________
prune_low_magnitude_conv2d_8 (None, 28, 18, 384)       2654594   
_________________________________________________________________
prune_low_magnitude_activati (None, 28, 18, 384)       1         
_________________________________________________________________
prune_low_magnitude_conv2d_9 (None, 26, 16, 256)       1769730   
_________________________________________________________________
prune_low_magnitude_activati (None, 26, 16, 256)       1         
_________________________________________________________________
prune_low_magnitude_max_pool (None, 13, 8, 256)        1         
_________________________________________________________________
prune_low_magnitude_flatten_ (None, 26624)             1         
_________________________________________________________________
prune_low_magnitude_dense_5  (None, 4096)              218107906 
_________________________________________________________________
prune_low_magnitude_activati (None, 4096)              1         
_________________________________________________________________
prune_low_magnitude_dropout_ (None, 4096)              1         
_________________________________________________________________
prune_low_magnitude_dense_6  (None, 4096)              33558530  
_________________________________________________________________
prune_low_magnitude_activati (None, 4096)              1         
_________________________________________________________________
prune_low_magnitude_dropout_ (None, 4096)              1         
_________________________________________________________________
prune_low_magnitude_dense_7  (None, 1000)              8193002   
_________________________________________________________________
prune_low_magnitude_activati (None, 1000)              1         
_________________________________________________________________
prune_low_magnitude_dropout_ (None, 1000)              1         
_________________________________________________________________
prune_low_magnitude_dense_8  (None, 7)                 14009     
_________________________________________________________________
prune_low_magnitude_activati (None, 7)                 1         
=================================================================
Total params: 272,085,089
Trainable params: 136,047,815
Non-trainable params: 136,037,274
_________________________________________________________________
