Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 148, 110, 96)      34944     
_________________________________________________________________
activation (Activation)      (None, 148, 110, 96)      0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 74, 55, 96)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 64, 45, 256)       2973952   
_________________________________________________________________
activation_1 (Activation)    (None, 64, 45, 256)       0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 32, 22, 256)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 30, 20, 384)       885120    
_________________________________________________________________
activation_2 (Activation)    (None, 30, 20, 384)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 28, 18, 384)       1327488   
_________________________________________________________________
activation_3 (Activation)    (None, 28, 18, 384)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 26, 16, 256)       884992    
_________________________________________________________________
activation_4 (Activation)    (None, 26, 16, 256)       0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 13, 8, 256)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 26624)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              109056000 
_________________________________________________________________
activation_5 (Activation)    (None, 4096)              0         
_________________________________________________________________
dropout (Dropout)            (None, 4096)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 4096)              16781312  
_________________________________________________________________
activation_6 (Activation)    (None, 4096)              0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 1000)              4097000   
_________________________________________________________________
activation_7 (Activation)    (None, 1000)              0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 1000)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 7)                 7007      
_________________________________________________________________
activation_8 (Activation)    (None, 7)                 0         
=================================================================
Total params: 136,047,815
Trainable params: 136,047,815
Non-trainable params: 0
_________________________________________________________________
