Model: "deepsqueeze"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 600, 450, 3) 0                                            
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 299, 224, 64) 1792        input_2[0][0]                    
__________________________________________________________________________________________________
relu_conv1 (Activation)         (None, 299, 224, 64) 0           conv1[0][0]                      
__________________________________________________________________________________________________
pool1 (MaxPooling2D)            (None, 149, 111, 64) 0           relu_conv1[0][0]                 
__________________________________________________________________________________________________
fire2/squeeze1x1 (Conv2D)       (None, 149, 111, 16) 1040        pool1[0][0]                      
__________________________________________________________________________________________________
fire2/relu_squeeze1x1 (Activati (None, 149, 111, 16) 0           fire2/squeeze1x1[0][0]           
__________________________________________________________________________________________________
fire2/expand1x1 (Conv2D)        (None, 149, 111, 64) 1088        fire2/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire2/expand3x3 (Conv2D)        (None, 149, 111, 64) 9280        fire2/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire2/relu_expand1x1 (Activatio (None, 149, 111, 64) 0           fire2/expand1x1[0][0]            
__________________________________________________________________________________________________
fire2/relu_expand3x3 (Activatio (None, 149, 111, 64) 0           fire2/expand3x3[0][0]            
__________________________________________________________________________________________________
fire2/concat (Concatenate)      (None, 149, 111, 128 0           fire2/relu_expand1x1[0][0]       
                                                                 fire2/relu_expand3x3[0][0]       
__________________________________________________________________________________________________
fire3/squeeze1x1 (Conv2D)       (None, 149, 111, 16) 2064        fire2/concat[0][0]               
__________________________________________________________________________________________________
fire3/relu_squeeze1x1 (Activati (None, 149, 111, 16) 0           fire3/squeeze1x1[0][0]           
__________________________________________________________________________________________________
fire3/expand1x1 (Conv2D)        (None, 149, 111, 64) 1088        fire3/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire3/expand3x3 (Conv2D)        (None, 149, 111, 64) 9280        fire3/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire3/relu_expand1x1 (Activatio (None, 149, 111, 64) 0           fire3/expand1x1[0][0]            
__________________________________________________________________________________________________
fire3/relu_expand3x3 (Activatio (None, 149, 111, 64) 0           fire3/expand3x3[0][0]            
__________________________________________________________________________________________________
fire3/concat (Concatenate)      (None, 149, 111, 128 0           fire3/relu_expand1x1[0][0]       
                                                                 fire3/relu_expand3x3[0][0]       
__________________________________________________________________________________________________
pool3 (MaxPooling2D)            (None, 74, 55, 128)  0           fire3/concat[0][0]               
__________________________________________________________________________________________________
fire4/squeeze1x1 (Conv2D)       (None, 74, 55, 32)   4128        pool3[0][0]                      
__________________________________________________________________________________________________
fire4/relu_squeeze1x1 (Activati (None, 74, 55, 32)   0           fire4/squeeze1x1[0][0]           
__________________________________________________________________________________________________
fire4/expand1x1 (Conv2D)        (None, 74, 55, 128)  4224        fire4/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire4/expand3x3 (Conv2D)        (None, 74, 55, 128)  36992       fire4/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire4/relu_expand1x1 (Activatio (None, 74, 55, 128)  0           fire4/expand1x1[0][0]            
__________________________________________________________________________________________________
fire4/relu_expand3x3 (Activatio (None, 74, 55, 128)  0           fire4/expand3x3[0][0]            
__________________________________________________________________________________________________
fire4/concat (Concatenate)      (None, 74, 55, 256)  0           fire4/relu_expand1x1[0][0]       
                                                                 fire4/relu_expand3x3[0][0]       
__________________________________________________________________________________________________
fire5/squeeze1x1 (Conv2D)       (None, 74, 55, 32)   8224        fire4/concat[0][0]               
__________________________________________________________________________________________________
fire5/relu_squeeze1x1 (Activati (None, 74, 55, 32)   0           fire5/squeeze1x1[0][0]           
__________________________________________________________________________________________________
fire5/expand1x1 (Conv2D)        (None, 74, 55, 128)  4224        fire5/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire5/expand3x3 (Conv2D)        (None, 74, 55, 128)  36992       fire5/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire5/relu_expand1x1 (Activatio (None, 74, 55, 128)  0           fire5/expand1x1[0][0]            
__________________________________________________________________________________________________
fire5/relu_expand3x3 (Activatio (None, 74, 55, 128)  0           fire5/expand3x3[0][0]            
__________________________________________________________________________________________________
fire5/concat (Concatenate)      (None, 74, 55, 256)  0           fire5/relu_expand1x1[0][0]       
                                                                 fire5/relu_expand3x3[0][0]       
__________________________________________________________________________________________________
pool5 (MaxPooling2D)            (None, 36, 27, 256)  0           fire5/concat[0][0]               
__________________________________________________________________________________________________
fire6/squeeze1x1 (Conv2D)       (None, 36, 27, 32)   8224        pool5[0][0]                      
__________________________________________________________________________________________________
fire6/relu_squeeze1x1 (Activati (None, 36, 27, 32)   0           fire6/squeeze1x1[0][0]           
__________________________________________________________________________________________________
fire6/expand1x1 (Conv2D)        (None, 36, 27, 128)  4224        fire6/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire6/expand3x3 (Conv2D)        (None, 36, 27, 128)  36992       fire6/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire6/relu_expand1x1 (Activatio (None, 36, 27, 128)  0           fire6/expand1x1[0][0]            
__________________________________________________________________________________________________
fire6/relu_expand3x3 (Activatio (None, 36, 27, 128)  0           fire6/expand3x3[0][0]            
__________________________________________________________________________________________________
fire6/concat (Concatenate)      (None, 36, 27, 256)  0           fire6/relu_expand1x1[0][0]       
                                                                 fire6/relu_expand3x3[0][0]       
__________________________________________________________________________________________________
fire7/squeeze1x1 (Conv2D)       (None, 36, 27, 32)   8224        fire6/concat[0][0]               
__________________________________________________________________________________________________
fire7/relu_squeeze1x1 (Activati (None, 36, 27, 32)   0           fire7/squeeze1x1[0][0]           
__________________________________________________________________________________________________
fire7/expand1x1 (Conv2D)        (None, 36, 27, 128)  4224        fire7/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire7/expand3x3 (Conv2D)        (None, 36, 27, 128)  36992       fire7/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire7/relu_expand1x1 (Activatio (None, 36, 27, 128)  0           fire7/expand1x1[0][0]            
__________________________________________________________________________________________________
fire7/relu_expand3x3 (Activatio (None, 36, 27, 128)  0           fire7/expand3x3[0][0]            
__________________________________________________________________________________________________
fire7/concat (Concatenate)      (None, 36, 27, 256)  0           fire7/relu_expand1x1[0][0]       
                                                                 fire7/relu_expand3x3[0][0]       
__________________________________________________________________________________________________
pool7 (MaxPooling2D)            (None, 17, 13, 256)  0           fire7/concat[0][0]               
__________________________________________________________________________________________________
fire8/squeeze1x1 (Conv2D)       (None, 17, 13, 32)   8224        pool7[0][0]                      
__________________________________________________________________________________________________
fire8/relu_squeeze1x1 (Activati (None, 17, 13, 32)   0           fire8/squeeze1x1[0][0]           
__________________________________________________________________________________________________
fire8/expand1x1 (Conv2D)        (None, 17, 13, 128)  4224        fire8/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire8/expand3x3 (Conv2D)        (None, 17, 13, 128)  36992       fire8/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire8/relu_expand1x1 (Activatio (None, 17, 13, 128)  0           fire8/expand1x1[0][0]            
__________________________________________________________________________________________________
fire8/relu_expand3x3 (Activatio (None, 17, 13, 128)  0           fire8/expand3x3[0][0]            
__________________________________________________________________________________________________
fire8/concat (Concatenate)      (None, 17, 13, 256)  0           fire8/relu_expand1x1[0][0]       
                                                                 fire8/relu_expand3x3[0][0]       
__________________________________________________________________________________________________
fire9/squeeze1x1 (Conv2D)       (None, 17, 13, 32)   8224        fire8/concat[0][0]               
__________________________________________________________________________________________________
fire9/relu_squeeze1x1 (Activati (None, 17, 13, 32)   0           fire9/squeeze1x1[0][0]           
__________________________________________________________________________________________________
fire9/expand1x1 (Conv2D)        (None, 17, 13, 128)  4224        fire9/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire9/expand3x3 (Conv2D)        (None, 17, 13, 128)  36992       fire9/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire9/relu_expand1x1 (Activatio (None, 17, 13, 128)  0           fire9/expand1x1[0][0]            
__________________________________________________________________________________________________
fire9/relu_expand3x3 (Activatio (None, 17, 13, 128)  0           fire9/expand3x3[0][0]            
__________________________________________________________________________________________________
fire9/concat (Concatenate)      (None, 17, 13, 256)  0           fire9/relu_expand1x1[0][0]       
                                                                 fire9/relu_expand3x3[0][0]       
__________________________________________________________________________________________________
pool9 (MaxPooling2D)            (None, 8, 6, 256)    0           fire9/concat[0][0]               
__________________________________________________________________________________________________
fire14/squeeze1x1 (Conv2D)      (None, 8, 6, 32)     8224        pool9[0][0]                      
__________________________________________________________________________________________________
fire14/relu_squeeze1x1 (Activat (None, 8, 6, 32)     0           fire14/squeeze1x1[0][0]          
__________________________________________________________________________________________________
fire14/expand1x1 (Conv2D)       (None, 8, 6, 128)    4224        fire14/relu_squeeze1x1[0][0]     
__________________________________________________________________________________________________
fire14/expand3x3 (Conv2D)       (None, 8, 6, 128)    36992       fire14/relu_squeeze1x1[0][0]     
__________________________________________________________________________________________________
fire14/relu_expand1x1 (Activati (None, 8, 6, 128)    0           fire14/expand1x1[0][0]           
__________________________________________________________________________________________________
fire14/relu_expand3x3 (Activati (None, 8, 6, 128)    0           fire14/expand3x3[0][0]           
__________________________________________________________________________________________________
fire14/concat (Concatenate)     (None, 8, 6, 256)    0           fire14/relu_expand1x1[0][0]      
                                                                 fire14/relu_expand3x3[0][0]      
__________________________________________________________________________________________________
fire15/squeeze1x1 (Conv2D)      (None, 8, 6, 32)     8224        fire14/concat[0][0]              
__________________________________________________________________________________________________
fire15/relu_squeeze1x1 (Activat (None, 8, 6, 32)     0           fire15/squeeze1x1[0][0]          
__________________________________________________________________________________________________
fire15/expand1x1 (Conv2D)       (None, 8, 6, 128)    4224        fire15/relu_squeeze1x1[0][0]     
__________________________________________________________________________________________________
fire15/expand3x3 (Conv2D)       (None, 8, 6, 128)    36992       fire15/relu_squeeze1x1[0][0]     
__________________________________________________________________________________________________
fire15/relu_expand1x1 (Activati (None, 8, 6, 128)    0           fire15/expand1x1[0][0]           
__________________________________________________________________________________________________
fire15/relu_expand3x3 (Activati (None, 8, 6, 128)    0           fire15/expand3x3[0][0]           
__________________________________________________________________________________________________
fire15/concat (Concatenate)     (None, 8, 6, 256)    0           fire15/relu_expand1x1[0][0]      
                                                                 fire15/relu_expand3x3[0][0]      
__________________________________________________________________________________________________
pool11 (MaxPooling2D)           (None, 3, 2, 256)    0           fire15/concat[0][0]              
__________________________________________________________________________________________________
fire10/squeeze1x1 (Conv2D)      (None, 3, 2, 48)     12336       pool11[0][0]                     
__________________________________________________________________________________________________
fire10/relu_squeeze1x1 (Activat (None, 3, 2, 48)     0           fire10/squeeze1x1[0][0]          
__________________________________________________________________________________________________
fire10/expand1x1 (Conv2D)       (None, 3, 2, 192)    9408        fire10/relu_squeeze1x1[0][0]     
__________________________________________________________________________________________________
fire10/expand3x3 (Conv2D)       (None, 3, 2, 192)    83136       fire10/relu_squeeze1x1[0][0]     
__________________________________________________________________________________________________
fire10/relu_expand1x1 (Activati (None, 3, 2, 192)    0           fire10/expand1x1[0][0]           
__________________________________________________________________________________________________
fire10/relu_expand3x3 (Activati (None, 3, 2, 192)    0           fire10/expand3x3[0][0]           
__________________________________________________________________________________________________
fire10/concat (Concatenate)     (None, 3, 2, 384)    0           fire10/relu_expand1x1[0][0]      
                                                                 fire10/relu_expand3x3[0][0]      
__________________________________________________________________________________________________
fire11/squeeze1x1 (Conv2D)      (None, 3, 2, 48)     18480       fire10/concat[0][0]              
__________________________________________________________________________________________________
fire11/relu_squeeze1x1 (Activat (None, 3, 2, 48)     0           fire11/squeeze1x1[0][0]          
__________________________________________________________________________________________________
fire11/expand1x1 (Conv2D)       (None, 3, 2, 192)    9408        fire11/relu_squeeze1x1[0][0]     
__________________________________________________________________________________________________
fire11/expand3x3 (Conv2D)       (None, 3, 2, 192)    83136       fire11/relu_squeeze1x1[0][0]     
__________________________________________________________________________________________________
fire11/relu_expand1x1 (Activati (None, 3, 2, 192)    0           fire11/expand1x1[0][0]           
__________________________________________________________________________________________________
fire11/relu_expand3x3 (Activati (None, 3, 2, 192)    0           fire11/expand3x3[0][0]           
__________________________________________________________________________________________________
fire11/concat (Concatenate)     (None, 3, 2, 384)    0           fire11/relu_expand1x1[0][0]      
                                                                 fire11/relu_expand3x3[0][0]      
__________________________________________________________________________________________________
fire12/squeeze1x1 (Conv2D)      (None, 3, 2, 64)     24640       fire11/concat[0][0]              
__________________________________________________________________________________________________
fire12/relu_squeeze1x1 (Activat (None, 3, 2, 64)     0           fire12/squeeze1x1[0][0]          
__________________________________________________________________________________________________
fire12/expand1x1 (Conv2D)       (None, 3, 2, 256)    16640       fire12/relu_squeeze1x1[0][0]     
__________________________________________________________________________________________________
fire12/expand3x3 (Conv2D)       (None, 3, 2, 256)    147712      fire12/relu_squeeze1x1[0][0]     
__________________________________________________________________________________________________
fire12/relu_expand1x1 (Activati (None, 3, 2, 256)    0           fire12/expand1x1[0][0]           
__________________________________________________________________________________________________
fire12/relu_expand3x3 (Activati (None, 3, 2, 256)    0           fire12/expand3x3[0][0]           
__________________________________________________________________________________________________
fire12/concat (Concatenate)     (None, 3, 2, 512)    0           fire12/relu_expand1x1[0][0]      
                                                                 fire12/relu_expand3x3[0][0]      
__________________________________________________________________________________________________
fire13/squeeze1x1 (Conv2D)      (None, 3, 2, 64)     32832       fire12/concat[0][0]              
__________________________________________________________________________________________________
fire13/relu_squeeze1x1 (Activat (None, 3, 2, 64)     0           fire13/squeeze1x1[0][0]          
__________________________________________________________________________________________________
fire13/expand1x1 (Conv2D)       (None, 3, 2, 256)    16640       fire13/relu_squeeze1x1[0][0]     
__________________________________________________________________________________________________
fire13/expand3x3 (Conv2D)       (None, 3, 2, 256)    147712      fire13/relu_squeeze1x1[0][0]     
__________________________________________________________________________________________________
fire13/relu_expand1x1 (Activati (None, 3, 2, 256)    0           fire13/expand1x1[0][0]           
__________________________________________________________________________________________________
fire13/relu_expand3x3 (Activati (None, 3, 2, 256)    0           fire13/expand3x3[0][0]           
__________________________________________________________________________________________________
fire13/concat (Concatenate)     (None, 3, 2, 512)    0           fire13/relu_expand1x1[0][0]      
                                                                 fire13/relu_expand3x3[0][0]      
__________________________________________________________________________________________________
drop13 (Dropout)                (None, 3, 2, 512)    0           fire13/concat[0][0]              
__________________________________________________________________________________________________
conv10 (Conv2D)                 (None, 3, 2, 7)      3591        drop13[0][0]                     
__________________________________________________________________________________________________
relu_conv10 (Activation)        (None, 3, 2, 7)      0           conv10[0][0]                     
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 7)            0           relu_conv10[0][0]                
__________________________________________________________________________________________________
loss (Activation)               (None, 7)            0           global_average_pooling2d_1[0][0] 
==================================================================================================
Total params: 1,022,727
Trainable params: 1,022,727
Non-trainable params: 0
__________________________________________________________________________________________________
