Model: "squeezenet"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 600, 450, 3) 0                                            
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 299, 224, 64) 1792        input_1[0][0]                    
__________________________________________________________________________________________________
relu_conv1 (Activation)         (None, 299, 224, 64) 0           conv1[0][0]                      
__________________________________________________________________________________________________
pool1 (MaxPooling2D)            (None, 149, 111, 64) 0           relu_conv1[0][0]                 
__________________________________________________________________________________________________
fire2/squeeze1x1 (Conv2D)       (None, 149, 111, 16) 1040        pool1[0][0]                      
__________________________________________________________________________________________________
fire2/relu_squeeze1x1 (Activati (None, 149, 111, 16) 0           fire2/squeeze1x1[0][0]           
__________________________________________________________________________________________________
fire2/expand1x1 (Conv2D)        (None, 149, 111, 64) 1088        fire2/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire2/expand3x3 (Conv2D)        (None, 149, 111, 64) 9280        fire2/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire2/relu_expand1x1 (Activatio (None, 149, 111, 64) 0           fire2/expand1x1[0][0]            
__________________________________________________________________________________________________
fire2/relu_expand3x3 (Activatio (None, 149, 111, 64) 0           fire2/expand3x3[0][0]            
__________________________________________________________________________________________________
fire2/concat (Concatenate)      (None, 149, 111, 128 0           fire2/relu_expand1x1[0][0]       
                                                                 fire2/relu_expand3x3[0][0]       
__________________________________________________________________________________________________
fire3/squeeze1x1 (Conv2D)       (None, 149, 111, 16) 2064        fire2/concat[0][0]               
__________________________________________________________________________________________________
fire3/relu_squeeze1x1 (Activati (None, 149, 111, 16) 0           fire3/squeeze1x1[0][0]           
__________________________________________________________________________________________________
fire3/expand1x1 (Conv2D)        (None, 149, 111, 64) 1088        fire3/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire3/expand3x3 (Conv2D)        (None, 149, 111, 64) 9280        fire3/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire3/relu_expand1x1 (Activatio (None, 149, 111, 64) 0           fire3/expand1x1[0][0]            
__________________________________________________________________________________________________
fire3/relu_expand3x3 (Activatio (None, 149, 111, 64) 0           fire3/expand3x3[0][0]            
__________________________________________________________________________________________________
fire3/concat (Concatenate)      (None, 149, 111, 128 0           fire3/relu_expand1x1[0][0]       
                                                                 fire3/relu_expand3x3[0][0]       
__________________________________________________________________________________________________
pool3 (MaxPooling2D)            (None, 74, 55, 128)  0           fire3/concat[0][0]               
__________________________________________________________________________________________________
fire4/squeeze1x1 (Conv2D)       (None, 74, 55, 32)   4128        pool3[0][0]                      
__________________________________________________________________________________________________
fire4/relu_squeeze1x1 (Activati (None, 74, 55, 32)   0           fire4/squeeze1x1[0][0]           
__________________________________________________________________________________________________
fire4/expand1x1 (Conv2D)        (None, 74, 55, 128)  4224        fire4/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire4/expand3x3 (Conv2D)        (None, 74, 55, 128)  36992       fire4/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire4/relu_expand1x1 (Activatio (None, 74, 55, 128)  0           fire4/expand1x1[0][0]            
__________________________________________________________________________________________________
fire4/relu_expand3x3 (Activatio (None, 74, 55, 128)  0           fire4/expand3x3[0][0]            
__________________________________________________________________________________________________
fire4/concat (Concatenate)      (None, 74, 55, 256)  0           fire4/relu_expand1x1[0][0]       
                                                                 fire4/relu_expand3x3[0][0]       
__________________________________________________________________________________________________
fire5/squeeze1x1 (Conv2D)       (None, 74, 55, 32)   8224        fire4/concat[0][0]               
__________________________________________________________________________________________________
fire5/relu_squeeze1x1 (Activati (None, 74, 55, 32)   0           fire5/squeeze1x1[0][0]           
__________________________________________________________________________________________________
fire5/expand1x1 (Conv2D)        (None, 74, 55, 128)  4224        fire5/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire5/expand3x3 (Conv2D)        (None, 74, 55, 128)  36992       fire5/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire5/relu_expand1x1 (Activatio (None, 74, 55, 128)  0           fire5/expand1x1[0][0]            
__________________________________________________________________________________________________
fire5/relu_expand3x3 (Activatio (None, 74, 55, 128)  0           fire5/expand3x3[0][0]            
__________________________________________________________________________________________________
fire5/concat (Concatenate)      (None, 74, 55, 256)  0           fire5/relu_expand1x1[0][0]       
                                                                 fire5/relu_expand3x3[0][0]       
__________________________________________________________________________________________________
pool5 (MaxPooling2D)            (None, 36, 27, 256)  0           fire5/concat[0][0]               
__________________________________________________________________________________________________
fire6/squeeze1x1 (Conv2D)       (None, 36, 27, 48)   12336       pool5[0][0]                      
__________________________________________________________________________________________________
fire6/relu_squeeze1x1 (Activati (None, 36, 27, 48)   0           fire6/squeeze1x1[0][0]           
__________________________________________________________________________________________________
fire6/expand1x1 (Conv2D)        (None, 36, 27, 192)  9408        fire6/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire6/expand3x3 (Conv2D)        (None, 36, 27, 192)  83136       fire6/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire6/relu_expand1x1 (Activatio (None, 36, 27, 192)  0           fire6/expand1x1[0][0]            
__________________________________________________________________________________________________
fire6/relu_expand3x3 (Activatio (None, 36, 27, 192)  0           fire6/expand3x3[0][0]            
__________________________________________________________________________________________________
fire6/concat (Concatenate)      (None, 36, 27, 384)  0           fire6/relu_expand1x1[0][0]       
                                                                 fire6/relu_expand3x3[0][0]       
__________________________________________________________________________________________________
fire7/squeeze1x1 (Conv2D)       (None, 36, 27, 48)   18480       fire6/concat[0][0]               
__________________________________________________________________________________________________
fire7/relu_squeeze1x1 (Activati (None, 36, 27, 48)   0           fire7/squeeze1x1[0][0]           
__________________________________________________________________________________________________
fire7/expand1x1 (Conv2D)        (None, 36, 27, 192)  9408        fire7/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire7/expand3x3 (Conv2D)        (None, 36, 27, 192)  83136       fire7/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire7/relu_expand1x1 (Activatio (None, 36, 27, 192)  0           fire7/expand1x1[0][0]            
__________________________________________________________________________________________________
fire7/relu_expand3x3 (Activatio (None, 36, 27, 192)  0           fire7/expand3x3[0][0]            
__________________________________________________________________________________________________
fire7/concat (Concatenate)      (None, 36, 27, 384)  0           fire7/relu_expand1x1[0][0]       
                                                                 fire7/relu_expand3x3[0][0]       
__________________________________________________________________________________________________
fire8/squeeze1x1 (Conv2D)       (None, 36, 27, 64)   24640       fire7/concat[0][0]               
__________________________________________________________________________________________________
fire8/relu_squeeze1x1 (Activati (None, 36, 27, 64)   0           fire8/squeeze1x1[0][0]           
__________________________________________________________________________________________________
fire8/expand1x1 (Conv2D)        (None, 36, 27, 256)  16640       fire8/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire8/expand3x3 (Conv2D)        (None, 36, 27, 256)  147712      fire8/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire8/relu_expand1x1 (Activatio (None, 36, 27, 256)  0           fire8/expand1x1[0][0]            
__________________________________________________________________________________________________
fire8/relu_expand3x3 (Activatio (None, 36, 27, 256)  0           fire8/expand3x3[0][0]            
__________________________________________________________________________________________________
fire8/concat (Concatenate)      (None, 36, 27, 512)  0           fire8/relu_expand1x1[0][0]       
                                                                 fire8/relu_expand3x3[0][0]       
__________________________________________________________________________________________________
fire9/squeeze1x1 (Conv2D)       (None, 36, 27, 64)   32832       fire8/concat[0][0]               
__________________________________________________________________________________________________
fire9/relu_squeeze1x1 (Activati (None, 36, 27, 64)   0           fire9/squeeze1x1[0][0]           
__________________________________________________________________________________________________
fire9/expand1x1 (Conv2D)        (None, 36, 27, 256)  16640       fire9/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire9/expand3x3 (Conv2D)        (None, 36, 27, 256)  147712      fire9/relu_squeeze1x1[0][0]      
__________________________________________________________________________________________________
fire9/relu_expand1x1 (Activatio (None, 36, 27, 256)  0           fire9/expand1x1[0][0]            
__________________________________________________________________________________________________
fire9/relu_expand3x3 (Activatio (None, 36, 27, 256)  0           fire9/expand3x3[0][0]            
__________________________________________________________________________________________________
fire9/concat (Concatenate)      (None, 36, 27, 512)  0           fire9/relu_expand1x1[0][0]       
                                                                 fire9/relu_expand3x3[0][0]       
__________________________________________________________________________________________________
drop9 (Dropout)                 (None, 36, 27, 512)  0           fire9/concat[0][0]               
__________________________________________________________________________________________________
conv10 (Conv2D)                 (None, 36, 27, 7)    3591        drop9[0][0]                      
__________________________________________________________________________________________________
relu_conv10 (Activation)        (None, 36, 27, 7)    0           conv10[0][0]                     
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 7)            0           relu_conv10[0][0]                
__________________________________________________________________________________________________
loss (Activation)               (None, 7)            0           global_average_pooling2d[0][0]   
==================================================================================================
Total params: 726,087
Trainable params: 726,087
Non-trainable params: 0
__________________________________________________________________________________________________
